export default function About() {
  return (
    <div className="container d-flex flex-column gap-4 auth-container general-container">
        <h3 className="text-warning">حول المنصة</h3>
        <p>منصة بناءك  <b>خطتك الذكية لبناء مشروعك</b>  هي منصة رقمية متكاملة تهدف إلى تنظيم وإدارة المشاريع الإنشائية بطريقة احترافية وشفافة. تعمل المنصة على ربط العميل بكافة الأطراف المعنية في قطاع البناء، مثل المهندسين المعماريين والمدنيين، المكاتب الهندسية، والمقاولين، ضمن بيئة رقمية واحدة.</p>
        <p>توفّر المنصة آلية مرنة لطرح المشاريع واستقبال العروض وفق نظام المناقصات، مع إمكانية اختيار تنفيذ المشروع بشكل منفصل لكل مرحلة أو تسليمه بالكامل لمكتب هندسي. كما تتيح متابعة مراحل العمل، تبادل الملفات، الاطلاع على التقارير، وإجراء التقييم النهائي بعد الإنجاز، مما يضمن وضوح الرؤية، جودة التنفيذ، وسهولة اتخاذ القرار.</p>
    </div>
  );
}
